name: "sid-minibert-onnx"
platform: "onnxruntime_onnx"
max_batch_size: 8192

input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [ 256 ]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT32
    dims: [ 256 ]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 10 ]
  }
]

dynamic_batching {
  preferred_batch_size: [ 512, 1024, 2048, 4096, 8192 ]
  max_queue_delay_microseconds: 50000
}

instance_group [
  {
    count: 2
    kind: KIND_GPU
  }
]
